##Merge join concat

#Merging
##merges on the basis of common columns

In [0]:
import pandas as pd

In [0]:
import numpy as np

In [0]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
 'data1': range(7)})

In [0]:
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
'data2': range(3)})

In [0]:
pd.merge(df1, df2) #only common column members are returned by default how_inner

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [0]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [0]:
df1['key2'] = ['c','d','a','b','a','c','a']
df1

  key  data1 key2
0   b      0    c
1   b      1    d
2   a      2    a
3   c      3    b
4   a      4    a
5   a      5    c
6   b      6    a

In [0]:
pd.merge(df1,df2)

  key  data1 key2  data2
0   b      0    c      1
1   b      1    d      1
2   b      6    a      1
3   a      2    a      0
4   a      4    a      0
5   a      5    c      0

In [0]:
result1 = pd.DataFrame({'Names' : ['lyma','leej','baidar','sera','susu','roma','neemal','isha'],
                       'Test1' : [90    ,     98,     97,    92,    93,   90,     97,    92  ],
                       'Test2' : [92    ,     91,     96,    94,    90,   91,     94,    99  ]})

In [0]:
result2 = pd.DataFrame({'Names' : ['leej'  ,'roma','neemal',  'susu' ,'baidar' ,'isha'  ,'sera' ,     'lyma'],
                       'pets'   : ['cat'   , 'cat', 'horse','rabbit' , 'camel' ,'parrot','none' ,  'beenish'],
                       'food'   : ['pizza' ,'rice',  'roti','chinese','noodles',  'daal','tacos',  'nachos' ]})

###common columns

In [0]:
pd.merge(result1, result2)

    Names  Test1  Test2     pets     food
0    lyma     90     92  beenish   nachos
1    leej     98     91      cat    pizza
2  baidar     97     96    camel  noodles
3    sera     92     94     none    tacos
4    susu     93     90   rabbit  chinese
5    roma     90     91      cat     rice
6  neemal     97     94    horse     roti
7    isha     92     99   parrot     daal

In [0]:
result3 = pd.DataFrame({'Names' : ['leej'  ,'roma','neemal',  'susu' ,'baidar' ,'isha'  ,'sera' ,     'lyma'],
                       'pets'   : [np.nan    ,'cat', np.nan ,'rabbit' , 'camel' ,'parrot',np.nan ,  'beenish'],
                       'food'   : ['pizza' ,'rice',  'roti',np.nan,'noodles',  'daal',np.nan,  'nachos' ]})

In [0]:
pd.merge(result1,result3, how = 'inner')   #default only common

    Names  Test1  Test2     pets     food
0    lyma     90     92  beenish   nachos
1    leej     98     91      NaN    pizza
2  baidar     97     96    camel  noodles
3    sera     92     94      NaN      NaN
4    susu     93     90   rabbit      NaN
5    roma     90     91      cat     rice
6  neemal     97     94      NaN     roti
7    isha     92     99   parrot     daal

In [0]:
pd.merge(result1, result3, how = 'outer')     #takes nan

    Names  Test1  Test2     pets     food
0    lyma     90     92  beenish   nachos
1    leej     98     91      NaN    pizza
2  baidar     97     96    camel  noodles
3    sera     92     94      NaN      NaN
4    susu     93     90   rabbit      NaN
5    roma     90     91      cat     rice
6  neemal     97     94      NaN     roti
7    isha     92     99   parrot     daal

#Joining
##on the basis of index

In [0]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
index=['a', 'c', 'e'],
columns=['Ohio', 'Nevada'])
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [0]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],
index=['b', 'c', 'd', 'e'],
columns=['Missouri', 'Alabama'])
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [0]:
left2.join(right2)  #by default  runs left how = 'left'

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [0]:
left2.join(right2, how = 'outer')             #shows all

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [0]:
left2.join(right2, how = 'inner')            #index has all values

   Ohio  Nevada  Missouri  Alabama
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

In [0]:
left2.join(right2, how = 'right')

   Ohio  Nevada  Missouri  Alabama
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [0]:
left2.join(right2, how = 'left')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
c   3.0     4.0       9.0     10.0
e   5.0     6.0      13.0     14.0

#Concatinating

In [0]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'],
columns=['one', 'two'])
df1

   one  two
a    0    1
b    2    3
c    4    5

In [0]:
df2 = pd.DataFrame(10 + np.arange(4).reshape(2, 2), index=['a', 'c'],
columns=['three', 'four'])
df2

   three  four
a     10    11
c     12    13

In [0]:
pd.concat([df1,df2])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   four  one  three  two
a   NaN  0.0    NaN  1.0
b   NaN  2.0    NaN  3.0
c   NaN  4.0    NaN  5.0
a   6.0  NaN    5.0  NaN
c   8.0  NaN    7.0  NaN